tests/card.api.artillery.yml
config:
  target: https://api.k32.ir
  http:
    extendedMetrics: true
  phases:
    - duration: 2
      arrivalRate: 1
      name: 'Preparation'
    - duration: 3
      arrivalRate: 1
      name: 'Normal'
    - duration: 6
      arrivalRate: 2
      name: 'Normal'
    - duration: 12
      arrivalRate: 3
      name: 'Heavy'

scenarios:
  - name: 'Index'
    flow:
      - get:
          url: /server-info