tests/card.app.artillery.yml
config:
  target: https://k32.ir
  phases:
    - duration: 15
      arrivalRate: 5
      name: 'Preparation'
    - duration: 30
      arrivalRate: 10
      name: 'Normal'
    - duration: 60
      arrivalRate: 20
      name: 'Heavy'

scenarios:
  - name: 'Index'
    flow:
      - get:
          url: '/'
  - name: 'Manifest'
    flow:
      - get:
          url: '/manifest.webmanifest'
  - name: 'Icon'
    flow:
      - get:
          url: '/favicon.ico'
  - name: 'Script'
    flow:
      - get:
          url: '/assets/index-BSYpN655.js'