tests/card.app.artillery.yml
config:
  target: https://k32.ir
  phases:
    - duration: 15
      arrivalRate: 5
      name: 'Preparation'
    - duration: 30
      arrivalRate: 10
      name: 'Normal'
    - duration: 60
      arrivalRate: 20
      name: 'Heavy'

scenarios:
  - name: 'Index'
    flow:
      - loop:
          - get:
              url: /