tests/card.app.artillery.yml
config:
  target: https://k32.ir
  # arrivalRate ^ 2 * 1.5
  phases:
    - duration: 15
      arrivalRate: 5
      name: 'Preparation'
    - duration: 60
      arrivalRate: 20
      name: 'Normal'
    - duration: 150
      arrivalRate: 50
      name: 'Middle'
    - duration: 900
      arrivalRate: 300
      name: 'Heavy'
scenarios:
  - engine: http
    name: 'Get Main PWA'
    weight: 6
    flow:
      - loop:
          - get:
              url: '/'